//玩楓小幫手 萬能NPC
var status = -1;
var selects = [
    "玩家指令介紹","領取功能性道具",
    "領取免費造型","領取外觀勳章",
    "幸運草金幣兌換","幸運草銀幣兌換",
    "投擲物合成","使用箭矢製作箭筒",
    "分解不速之客裝備","製作不速之客裝備",
    "楓葉武器抽獎","領取宅配道具",
    "點裝倉庫","滿包倉庫",
    "前往幸福村","開啟紅色禮物盒",
    "燃燒活動","二次招生免費禮包"
    //"感恩節活動兌換"
    //"萬聖舞會抽獎"
    //"中秋節活動兌換","雙十節活動兌換"
    //"事前登入創立公會","事前登入公會徽章"

]
var seljs = [
    "[功能]help","[幫手]領取功能性道具",
    "[功能]領取免費造型","[功能]領取外觀勳章",
    "[兌換]幸運草金幣","[兌換]幸運草銀幣",
    "[兌換]投擲物合成","[兌換]使用箭矢製作箭筒",
    "[兌換]分解不速之客裝備","[兌換]製作不速之客裝備",
    "[抽獎]楓葉武器抽獎","[幫手]領取宅配道具",
    "[倉庫]點裝倉庫","[倉庫]滿包倉庫",
    "[活動]前往幸福村","[活動]開啟紅色禮物盒",
    "[燃燒]燃燒活動","[活動]二次招生免費禮包"
    //"[活動]感恩節活動兌換",
    //"[活動]萬聖舞會抽獎"
    //"[活動]中秋節活動兌換","[活動]雙十節活動兌換"
    //"[事前]事前登入創立公會","[事前]事前登入公會徽章",
]

var icons = [
    4031966,5530005,
    5153013,1142000,
    4030002,4030002,
    2070018,2450302,
    4030002,1302145,
    1302030,2022615,
    1702020,2022615,
    1142580,4030002,
    1113997,2450105
    //2002029,
    //4030002,
    //2002028,4030002,
    //1146195,1146195,
];
var npc = [
    9401434,9401434,
    9401434,9401434,
    9401434,9401434,
    9401434,9401434,
    9401434,9401434,
    9401434,9010009,
    9401434,9401434,
    9401434,9401434,
    9401434,9401434,
    //9010095,
    //9001103,9401434,
    //2010007,2010008,
]

function start() {
    action(1,0,0);
}
  
function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        cm.dispose();
        return;
    } else {
        cm.dispose();
        return;
    }
    

    switch(status) {
        case 0:
            var msg = "我是山羊谷的#b玩楓小幫手 - 快樂菇菇#k，你想要找我做什麼呢\r\n";
            msg += "#n\r\n";
            //for(var i = 0; i < selects.length; i++) {
            //    msg += "#L" + i + "##i" + icons[i] + "##r " + selects[i] + "#b";
            //    if(i % 2 == 1){msg +="\r\n"}
            //}
            var count = 0;
            for(var i = 0; i < selects.length; i++) {
                var append = selects[i];
                if (append.length < 8) {
                    var missingLength = 8 - append.length;
                    for (var j = 0; j < missingLength; j++) {
                        append += '  ';
                    }
                }
                msg += "#L" + i + "##i" + /*icons[i] +*/ "##b" + append;
                count++;
                if(count >= 2) {
                    msg += "\r\n";
                    count = 0;
                }
            }
            cm.sendNext(msg);
            break;
        case 1:
            cm.dispose();
            cm.openNpc(npc[selection], ""+seljs[selection]);
            break;
        default:
            cm.dispose();
    }
}