var status = -1;
var currentPlayers;
var victum;

var useMeso = 10000000;

var items = [
    2210000, 2210001, 2210002, 2210003, 2210004, 2210005, 2210006, 2210007, 2210009, 2210012, 2210013, 2210014, 2210015, 2210016, 2210017, 2210018, 2210019, 2210020, 2210021, 
    2210022, 2210025, 2210026, 2210027, 2210028, 2210029, 2210030, 2210031, 2210034, 2210035, 2210036, 2210037, 2210038, 2210039, 2210040, 2210041, 2210042, 2210044, 2210045, 2210046, 2210047, 
    2210061, 2210065, 2210066, 2210067, 2210068, 2210069, 2210070, 2210081, 2210082, 2210084, 2210085, 2210086, 2210091, 2210103, 2210104, 2210105, 2210106, 2210107, 2210108, 2210109, 2210110, 
    2210111, 2210112, 2210113, 2210114, 2210115, 2210118, 2210120, 2210121, 2210122, 2210123, 2210124, 2210125, 2210126, 2210127, 2210128, 2210129, 2210131, 2210132, 2210133, 2210135, 2210136, 
    2210138, 2210139, 2210140, 2210141, 2210164, 2210165, 2210166, 2210167, 2210168, 2210169, 2210170, 2210171, 2210172, 2210175, 2210176, 2210177, 2210178, 2210179, 2210181, 2210182, 2210183, 
    2210184, 2210185, 2210186, 2210191, 2210192, 2210193, 2210194, 2210195, 2210196, 2210197, 2210199, 2210200, 2210202, 2210203, 2210204, 2210205, 2210207, 2210208, 2210209, 2210210, 2210211, 
    2210217, 2210218, 2210219, 2210220, 2210221, 2210222, 2210257, 2210258, 2210259, 2210262, 2210263, 2210264, 2210265, 2210266, 2210267, 2210268, 2210269, 2210270, 2210271, 2210272, 2210273, 
    2210274, 2213000, 2213001, 2213002, 2213003, 2213004, 2213005, 2213006, 2213007, 2213008, 2213009, 2213010, 2213011, 2213012, 2213013, 2213014, 2213015, 2213016, 2213017, 2213018, 2213019, 
    2213020, 2213021, 2213022, 2213023, 2213024, 2213025, 2213026, 2213027, 2213028, 2213029, 2213030, 2213031, 2213032, 2213033, 2213034, 2213035, 2213036, 2213037, 2213038, 2213039, 2213040, 
    2213041, 2213043, 2213070, 2213071, 2213072
]

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        cm.dispose();
        return;
    }

    switch (status) {
        case 0:
            var msg = "請選擇您想要捉弄的對象\r\n\r\n";
            var players = cm.getPlayer().getMap().getCharactersThreadsafe();
            currentPlayers = players;
            var append = "";
            for(var i = 0; i < players.length; i++) {
                var player = players[i];
                if(player == cm.getPlayer()) continue;
                // if(player.isGM()) continue;
                append += "#L" + i + "##b" + player.getName() + "#k\r\n";
            }
            if(append == "") {
                cm.sendOk("目前地圖上沒有其他玩家唷！");
                cm.dispose();
                return;
            }
            cm.sendNext(msg + append);
            break;
        case 1:
            victum = currentPlayers[selection];
            var msg = "請選擇變身的項目\r\n\r\n";
            for(var i = 0; i < items.length; i++) {
                msg += "#L" + i + "##b#i" + items[i] + ":##t" + items[i] + "##k" + items[i]  +  "\r\n";
            }
            cm.sendNext(msg);
            break;
        case 2:
            if(cm.getPlayer().getMeso() < useMeso) {
                cm.sendOk("很抱歉，您的楓幣不足唷！");
                cm.dispose();
                return;
            }
            if(cm.getPlayer().getMap() != victum.getMap()) {
                cm.sendOk("該玩家已經離開地圖了");
                cm.dispose();
                return;
            }
            var result = victum.applyMorphBuff(items[selection], false);
            if(!result) {
                cm.sendOk("該玩家正在坐著椅子釣魚唷，無法進行變身");
                cm.dispose();
                return;
            }
            victum.dropMessage(5,"有個壞壞的玩家將您變身了！");
            cm.gainMeso(-useMeso);
            cm.dispose();
            return;
        default:
            cm.dispose();
            return;
    }
}

