var status = -1;
var sel;
var money = 0;
var price = 0;
var priceLevel = [1888, 3000, 5000, 10000, 15000, 19999, 20000, 25000, 30000, 40000, 49999, 50000, 60000, 70000, 80000, 90000, 100000, 
    120000, 140000, 160000, 180000, 200000, 220000, 240000, 260000, 280000, 300000,
    320000, 340000, 360000, 380000, 400000, 420000, 440000, 460000, 480000, 500000
]
var todayRewardPriceLevel = [
    1000, 3000, 5000, 10000, 11000, 13000, 15000, 20000, 21000, 23000, 25000, 30000, //31000, 33000, 35000, 40000, 41000, 43000, 45000, 50000, 51000, 53000, 55000, 60000
]

var rewardType = 0;

var todayReward = {
    1000: [
        [4030002, 300], [5220040, 3], 
    ],
    3000: [
        [4030002, 700], [5220040, 7], 
    ],
    5000: [
        [4030002, 1000], [2340000, 1], [5220040, 5],
    ],
    10000: [
        [4030205, 1], [4030002, 2000], [5220040, 5],
    ],
    11000: [
        [4030002, 300], [5220040, 3], 
    ],
    13000: [
        [4030002, 700], [5220040, 7], 
    ],
    15000: [
        [4030002, 1000], [2340000, 1], [5220040, 5],
    ],
    20000: [
        [4030205, 1], [4030002, 2000], [5220040, 5],
    ],
    21000: [
        [4030002, 300], [5220040, 3], 
    ],
    23000: [
        [4030002, 700], [5220040, 7], 
    ],
    25000: [
        [4030002, 1000], [2340000, 1], [5220040, 5],
    ],
    30000: [
        [4030205, 1], [4030002, 2000], [5220040, 5],
    ],
//    31000: [
//       [4310012, 50],
//    ],
//    33000: [
//        [4310012, 150],
//    ],
//    35000: [
//        [4310012, 150],
//        [4030002, 1]
//    ],
//    40000: [
//        [4310012, 400],
//        [2049304, 1]
//    ],
//    41000: [
//        [4310012, 50],
//    ],
//    43000: [
//        [4310012, 150],
//    ],
//    45000: [
//        [4310012, 150],
//        [4030002, 1]
//    ],
//    50000: [
//        [4310012, 400],
//        [2049304, 1]
//    ],
//    51000: [
//        [4310012, 50],
//    ],
//    53000: [
//        [4310012, 150],
//    ],
//    55000: [
//        [4310012, 150],
//        [4030002, 1]
//    ],
//    60000: [
//        [4310012, 400],
//        [2049304, 1]
//    ],
}

var items = {
    1888: [
        [5533124, 1], //5533124
        [2450000, 1], //2450000
        [4032878, 2], //4032878
        //[]卯咪任意門x2
        [5220040, 1], //楓葉轉蛋券x1
        [5076000, 3], //道具喇叭x3
    ],
    3000: [
        [5533124,5],
        [5530577,1],
    ],
    5000: [
        [1122059,1],
        [5530577,1],
        [2450000,2],
    ],
    10000: [
        [4032878,5],
        [5076000,5],
        [5530577,1],
        [2450000,2],
    ],
    15000: [
        [4032878,5],
        [5533124,5],
        [5530577,1],
        [2450000,2],
    ],
    19999: [
        [5530265,1],
    ],
    20000: [
        [4032878,5],
        [5561000,5],
        [5041000,5],
        [2450000,2],
    ],
    25000: [
        [2049202,3],
        [5076000,5],
        [5533124,5],
        [2450000,2],
    ],
    30000: [
        [2049206,3],
        [5561000,5],
        [5041000,5],
        [2450000,2],
    ],
    40000: [
        [2049207,1],
        [5076000,5],
        [5533124,5],
        [2450000,3],
        [5220040,2],
    ],
    49999: [
        [5530266,1],
    ],
    50000: [
        [2049207,1],
        [5561000,5],
        [5041000,5],
        [2450000,3],
        [5220040,2],
    ],
    60000: [
        [2049208,1],
        [5076000,5],
        [5533124,5],
        [2450000,3],
        [5220040,2],
    ],
    70000: [
        [2340000,1],
        [5561000,5],
        [5041000,5],
        [2450000,3],
        [5220040,2],
    ],
    80000: [
        [2049304,1],
        [5076000,5],
        [5533124,5],
        [2450000,3],
        [5220040,2],
    ],
    90000: [
        [2049201,1],
        [5561000,5],
        [5041000,5],
        [2450000,3],
        [5220040,2],
    ],
    100000: [
        [2340000,1],
        [2049304,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [2450000,5],
    ],
    120000: [
        [2049201,2],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    140000: [
        [2340000,1],
        [2049304,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    160000: [
        [2049201,2],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    180000: [
        [2340000,1],
        [2049304,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    200000: [
        [2340000,1],
        [2049304,1],
        [2049201,1],
        [5561000,5],
        [5041000,5],
        [5533124,15],
        [2450000,5]
    ],
    220000: [
        [2340000,1],
        [2049304,1],
        [2049303,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    240000: [
        [2049201,2],
        [2049202,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    260000: [
        [2340000,1],
        [2049304,1],
        [2049303,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    280000: [
        [2049201,2],
        [2049202,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    300000: [
        [4034054,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,15],
        [2450000,5]
    ],
    320000: [
        [2340000,1],
        [2049304,1],
        [4032878,10],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    340000: [
        [2049201,2],
        [4032878,10],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    360000: [
        [2340000,1],
        [2049304,1],
        [4032878,10],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    380000: [
        [2049201,2],
        [4032878,10],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    400000: [
        [4034054,1],
        [4032878,10],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,15],
        [2450000,5],
    ],
    420000: [
        [2340000,1],
        [2049304,1],
        [2049201,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    440000: [
        [2340000,1],
        [2049304,1],
        [2049201,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    460000: [
        [2340000,1],
        [2049304,1],
        [2049201,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    480000: [
        [2340000,1],
        [2049304,1],
        [2049201,1],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [5220040,5],
    ],
    500000: [
        [4034054,1],
        [4032878,10],
        [5561000,5],
        [5041000,5],
        [5076000,5],
        [5533124,5],
        [2450000,5],
        [5220040,5],
    ]
};

function start() {
    action(1,0,0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        cm.dispose();
        return;
    } else {
        cm.dispose();
        return;
    }

    var today = new Date();
    var year = today.getFullYear();
    var month = today.getMonth() + 1; // 月份從 0 開始，所以要 +1
    var day = today.getDate();

    switch(status) {
        case 0:
            var msg = "喵囉！#b#h  ##k 你要領取累積捐獻的額外獎勵嗎？\r\n#b";
            // msg += "\r\n#L1##k我想領取#b累積捐獻罐罐#k額外獎勵";
            msg += "\r\n#L2#我想領取#r 當日 #b累積捐獻罐罐#k額外獎勵(每日重置)";
            cm.sendOk(msg);
            break;
        case 1:
            sel = selection;
            if(sel == 1){
                var msg = "喵囉！#b#h  ##k 你要領取累積捐獻的額外獎勵嗎？\r\n#b";
                for(var i = 0; i < priceLevel.length; i++) {
                    var price = priceLevel[i];
                    var totaldonate = cm.getPlayer().getTotalDonate();
                    if(totaldonate + 20000 >= price) {
                        msg += "\r\n#L" + i + "#我想領取 #e#r" + price + "#n#b 累積捐獻罐罐額外獎勵#l";
                    }
                    rewardType = 1;
                }
                cm.sendNext(msg);
            }else if(sel == 2){
                var playerAccount = cm.getClient().getAccountName();
                var todayDonate = cm.getTodayDonateAmt(playerAccount);
                var playerName = cm.getPlayer().getName();
                var msg = "以下是所有#r當日滿額累積捐獻罐罐#k額外獎勵\r\n";
                msg += "\r\n#e        #b" + playerName + "#r 今日 #k累積的捐獻罐罐： " + todayDonate;

                var index = 0;
                for(var key in todayReward) {
                    msg += "\r\n#b#L" + index + "#我想領取 #e#r" + key + "#n#b 累積捐獻罐罐額外獎勵#l";
                    if(key == 10000){
                        msg += "\r\n\r\n\r\n#k==================第二輪==================";
                    }else if (key == 20000){
                        msg += "\r\n\r\n\r\n#k==================第三輪==================";
                    //}else if (key == 30000){
                    //    msg += "\r\n\r\n\r\n#k==================第四輪==================";
                    //}else if (key == 40000){
                    //    msg += "\r\n\r\n\r\n#k==================第五輪==================";
                    //}else if (key == 50000){
                    //    msg += "\r\n\r\n\r\n#k==================第六輪==================";
                    }
                    var accountOnlyLog = cm.getPlayer().getAccountOnly(year +"-"+ month +"-"+ day + "當日滿額禮包: " + key + "已領取");
                    if (accountOnlyLog > 0) {
                        msg += " (已領取)";
                    } else if (todayDonate >= key) {
                        msg += " (可領取)";
                    }
                    msg += "#l\r\n";
                    index++;
                    // for(var i = 0; i < todayReward[key].length; i++) {
                    //     msg += "#b#i" + todayReward[key][i][0] + ":##t" + todayReward[key][i][0] + "# x" + todayReward[key][i][1];
                    //     if (todayDonate >= key) {
                    //         msg += " (可領取)";
                    //     }
                    //     msg += "\r\n";
                    // }
                }
                rewardType = 2;
            }
            cm.sendNext(msg);
            break;
        case 2:
            sel = selection;
            if(rewardType == 1){ //累積捐獻
                price = priceLevel[sel];        
                var item = items[price];
            }else if(rewardType == 2) { //當日累斗
                price = todayRewardPriceLevel[sel];
                var item = todayReward[price];
            }
            var msg = "#e以下是#r" + price + "#k滿額禮包的內容！\r\n";
            for(var i = 0; i < item.length; i++) {
                msg += "\r\n#b#i" + item[i][0] + ":##t" + item[i][0] + "# x" + item[i][1] + " 個";
            }
            msg += "\r\n\r\n#r確定要領取這個階段的累積獎勵嗎？#r\r\n#e※請先再次確認您的背包空位是否足夠領取所有道具#k";
           
           cm.sendYesNo(msg);
           break;
       case 3:


           if(rewardType == 1){ //累積捐獻
                price = priceLevel[sel];        
                var item = items[price];

                if(cm.getPlayer().getTotalDonate() < price) {
                    cm.sendOk("呀咧呀咧，人類你的累計捐獻積分不足 " + price + " 唷！");
                    cm.dispose();
                    return;
                }

                var accountOnlyLog = "累積捐獻:"+price;
                if(cm.getPlayer().getAccountOnly(accountOnlyLog) > 0) {
                    cm.sendOk("呀咧呀咧，這個階段的累積捐獻的獎勵你似乎已經領取過了！！");
                    cm.dispose();
                    return;
                }
            }else if(rewardType == 2) { //當日累斗
                price = todayRewardPriceLevel[sel];
                var item = todayReward[price];
                var playerAccount = cm.getClient().getAccountName();
                var todayDonate = cm.getTodayDonateAmt(playerAccount);
                if(todayDonate < price) {
                    cm.sendOk("呀咧呀咧，人類你今日累計捐獻積分不足 " + price + " 唷！");
                    cm.dispose();
                    return;
                }

                var accountOnlyLog = year +"-"+ month +"-"+ day + "當日滿額禮包: " + price + "已領取";
                if(cm.getPlayer().getAccountOnly(accountOnlyLog) > 0) {
                    cm.sendOk("呀咧呀咧，今天這個階段的累積捐獻的獎勵你似乎已經領取過了！！");
                    cm.dispose();
                    return;
                }
            }
            
            var check = new Array();
            var c = 0;
            for(var i = 1;  i < item.length; i++) {
                if(item[i][2] == 0) {
                    check[c] = [];
                    check[c][0] = item[i][0];
                    check[c][1] = item[i][1];
                    c++;
                }
            }
            if(!cm.canHold(check)) {
                cm.sendOk("呀咧呀咧，你的背包空間不足唷！");
                cm.dispose();
                return;
            }
//            var check2 = 0;
//            for(var i = 1; i < item.length; i++) {
//                if(item[i][2] == 3) {
//                    check2 += money;
//                }
//            }
//            if(cm.getPlayer().getMeso() + check2 < 0) {
//                cm.sendOk("呀咧呀咧，請確認身上楓幣是否過多！");
//                cm.dispose();
//                return;
//            }
            if(!cm.getPlayer().setAccountOnly(accountOnlyLog)) {
                cm.sendOk("呀咧呀咧，發生系統異常，請聯繫GM！");
                cm.dispose();
                return;
            }
            for(var i = 0; i < item.length; i++) {
                cm.gainItem(item[i][0], item[i][1]);
            }
            if(rewardType == 1){
                cm.setLog("Donate.txt", (cm.getPlayer().getName() + " 兌換了 " + price + " 累計獎勵"));
            }else{
                cm.setLog("Donate.txt", (cm.getPlayer().getName() + " 兌換了 " + price + " 每日滿額禮包"));
            }
            cm.sendOk("兌換成功，分給你我的罐..啊是獎勵了！");
            cm.dispose();
            return;
        default:
            cm.dispose();
    }
}