function start() {
    var msg = "#r#e【釣魚說明】#n\r\n\r\n";
    msg += "#b【普通釣魚】#k\r\n";
    msg += "需要準備以下道具：\r\n";
    msg += "#r#i5340000:##t5340000:# x1 #k、#r#i2300000:##t2300000:# #k、#r#i3018043#任意椅子\r\n\r\n#k";
    msg += "#b【高級釣魚】#k\r\n";
    msg += "需要準備以下道具：\r\n";
    msg += "#r#i5340001:##t5340001:# x1 #k、#r#i2300001:##t2300001:# #k、#r#i3018388#任意椅子\r\n\r\n#k";
    msg += "#b【釣魚地點】#k\r\n";
    msg += "自由市場入口、精靈釣魚場\r\n\r\n";
    msg += "#b【釣魚收穫時間】#k\r\n";
    msg += "普通釣魚：每2分鐘收穫1次\r\n";
    msg += "高級釣魚：每1分鐘收穫1次\r\n\r\n";
    msg += "#b【可以獲得的獎勵】#k\r\n";
    msg += "#r#i4030002:##t4030002:##k、#r#i4031627:##t4031627:##k、#r#i4031628:##t4031628:##k、 #r#i4031630:##t4031630:##k、#r#i4031631:##t4031631:##k";
    cm.sendOk(msg);
    cm.dispose();
}