var status = -1;
var sel = -1;

// 第三欄位用於LOG紀錄，不可更改敘述
var quest = [
    [
        ["火獨眼獸與緞帶肥肥",20,"火獨眼獸與緞帶肥肥"],
        [2014,2015,2016,2108,8642],
        [
            [5533124,1],
            [5072000,3],
            [2049200,5],
            [5530577,1],
        ]
    ],
    [
        ["酷獸紅寶王",20,"酷獸紅寶王"],
        [2153,2154,2155,2156],
        [
            [4032878,1],
            [5561000,3],
            [2049200,5],
            [2450000,1],
        ]
    ],
    [
        ["黑肥肥、刺菇菇與殭屍菇菇",25,"黑肥肥、刺菇菇與殭屍菇菇"],
        [8643,2010,2071,2072,2106,2107],
        [
            [5533124,1],
            [5072000,3],
            [2049200,5],
            [5530577,1],
        ]
    ],
    [
        ["菇菇王國",30,"菇菇王國"],
        [2312,2313,2314,2315,2316,2317,2318,2319,2320,2321,2322,2323,2324,2325,2326,2327,2328,2329],
        [
            [5533124,2],
            [5072000,3],
            [2049200,5],
            [5530577,1],
            [1142188,1],
        ]
    ],
    [
        ["酷獸木妖王",30,"酷獸木妖王"],
        [2144,2145,2146,2148,2149,2150,2151,2152],
        [
            [4032878,1],
            [5561000,3],
            [2049200,5],
            [2450000,1],
        ]
    ],
    [
        ["玩具城與馬堤安",40,"玩具城與馬堤安"],
        [3206,3207,3208,3209,3210,3211,3212,3213,3214,3215,3216,3217,3218,3219,3220,3226,3227,3430,3431,3432,3433,3434,3435],
        [
            [5533124,2],
            [5072000,3],
            [2049200,5],
        ]
    ],
    [
        ["酷獸巨居蟹",50,"酷獸巨居蟹"],
        [2157,2158,2159,2160,2161],
        [
            [4032878,1],
            [5561000,3],
            [2049200,5],
        ]
    ],
    [
        ["武陵桃園系列1",50,"武陵桃園系列1"],
        [3800,3801,3802,3816,3817,3834,3807,3808,3818,3819,3803,3804,3833,3831],
        [
            [5533124,2],
            [2049300,1],
            [2049200,5],
        ]
    ],
    [
        ["武陵桃園系列2",60,"武陵桃園系列2"],
        [3820,3805,3806,3832],
        [
            [5533124,2],
            [5076000,3],
            [2049200,5],
        ]
    ],
    [
        ["酷獸肯德熊",60,"酷獸肯德熊"],
        [3835,3836,3837,3838,3839],
        [
            [4032878,1],
            [5561000,3],
            [2049200,5],
        ]
    ],
    [
        ["酷獸喵怪仙人",60,"酷獸喵怪仙人"],
        [3840,3841,3842,3843,3844],
        [
            [4032878,1],
            [5561000,3],
            [2049200,5],            
        ]
    ],
    [
        ["上古魔書系列",70,"上古魔書系列"],
        [3004,3005,3006,3007,3008,3009,3010,3011,3012,3013,3014,3015,3016,3017,3018,3019,3020,3021,3022,3023,3024,3025,3026,3027,3028,3029,3030,3031,3032,3033,3034,3035],
        [
            [5533124,2],
            [4032878,1],
            [5561000,3],
            [2049200,10],
        ]
    ],
    [
        ["酷獸九尾狐",80,"酷獸九尾狐"],
        [3641,3642,3643,3644,3645,3646,3647],
        [
            [4032878,1],
            [5561000,3],
            [2049200,5],
        ]
    ],
    [
        ["酷獸艾利傑",80,"酷獸艾利傑"],
        [3111,3112,3113,3114],
        [
            [4032878,1],
            [5561000,3],
            [2049200,5],
        ]
    ],
    [
        ["酷獸雪原怪人",80,"酷獸雪原怪人"],
        [3105,3106,3107,3108,3109,3110],
        [
            [4032878,1],
            [5561000,3],
            [2049200,5],
        ]
    ],
    [
        ["瘋狂喵z客系列",85,"瘋狂喵z客系列"],
        [8683,8684,8685,8686,8687],
        [
            [5533124,2],
            [5076000,3],
            [2049200,5],
        ]
    ],
    [
        ["神木村系列",90,"神木村系列"],
        [3700,3701,3702,3703,3704,3708,3709,3710,3711,3712],
        [
            [5533124,2],
            [5076000,3],
            [5220040,1],
            [2049202,1],
        ]
    ],
    [
        ["玩具城、水世界、昭和村委託",100,"玩具城、水世界、昭和村高階委託"],
        [8052,8028,8033,8106,3084,3078,3444,3445,3446],
        [
            [5533124,2],
            [5076000,3],
            [5220040,1],
            [2049202,1],
        ]
    ],
    [
        ["拉圖斯、海怒斯系列",110,"拉圖斯、海怒斯系列"],
        [7100,7101,7102,7103,7104,3075,3076,3077],
        [
            [5533124,2],
            [2049300,1],
            [5220040,1],
            [2049202,1],
        ]
    ],
    [
        ["時間神殿系列",120,"時間神殿系列"],
        [3500,3501,3502,3503,3504,3505,3506,3507,3508,3509,3510,3511,3512,3513,3514,3515,3516,3517,3518,3519,3520,3521],
        [
            [5533124,2],
            [2049300,3],
            [5220040,1],
            [2049202,1],
        ]
    ],
    [
        ["高階遠征BOSS系列",160,"高階遠征BOSS系列"],
        [3707,3522,50018,8131],
        [
            [4032878,3],
            [5220040,3],
            [2049202,5],
        ]
    ]
]


function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {

    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        cm.dispose();
        return;
    } else {
        cm.dispose();
        return;
    }

    switch(status) {
        case 0:
            var msg = "#b您好，我是山羊谷任務小幫手，我已經大幅提升了這些任務的經驗值，能提供您大量經驗，並且解完之後也會提供您豐厚的獎勵唷！#k\r\n\r\n";
            msg += "#r#e※還沒20等的冒險者們可以到各職業的訓練場(王年海)進行練等，該地圖會有12倍的經驗值唷！#k#n\r\n";
            for(var i = 0; i < quest.length; i++) {
                msg += "#L" + i + "##b" + quest[i][0][0] + ", 建議等級" + quest[i][0][1] + "等" + (cm.getPlayer().getCharacterOnly(log(i)) > 0 ? "#r(已領取)#k#n" : "") +  "\r\n";
            }
            cm.sendNext(msg);
            break;
        case 1:
            sel = selection;
            var msg = "若您要完成#b" + quest[sel][0][0] + "，需完成以下任務\r\n\r\n";
            var mission = quest[sel][1];
            for(var i = 0; i < mission.length; i++) {
                msg += "#b" + cm.getPlayer().getQuestName(mission[i]) + (cm.getPlayer().getCompletedQuests(mission[i]) ? "#b 已完成#k" : "#r 未完成#k") +"\r\n";
            }
            msg += "\r\n====================================\r\n";
            msg += "任務完成獎勵如下：\r\n\r\n";
            var prizes = quest[sel][2];
            for(var i = 0; i < prizes.length; i++) {
                var prize = prizes[i];
                msg += "#b#i" + prize[0] + ":##t" + prize[0] + "##k x" + prize[1] + "個\r\n";
            }
            msg += "\r\n您要領取獎勵嗎？";
            cm.sendYesNo(msg);
            break;
        case 2:
            var questStatus = true;
            var mission = quest[sel][1];
            for(var i = 0; i < mission.length; i++) {
                if(!cm.getPlayer().getCompletedQuests(mission[i])) {
                    questStatus = false;
                }
            }
            if(!questStatus) {
                cm.sendOk("您還有部分任務未完成唷！");
                cm.dispose();
                return;
            }
            if(cm.getPlayer().getCharacterOnly(log(sel)) > 0) {
                cm.sendOk("很抱歉，您已經領取過獎勵囉！");
                cm.dispose();
                return;
            }

            var item = quest[sel][2];
            var check = [];
            for (var i = 0; i < item.length; i++) {
                check.push([item[i][0], item[i][1]]);
            }

            if(!cm.canHold(check)) {
                cm.sendOk("請確認背包空間是否足夠唷！");
                cm.dispose();
                return;
            }
            cm.getPlayer().setCharacterOnly(log(sel));
            for(var i = 0; i < item.length; i++) {
                cm.gainItem(item[i][0], item[i][1]);
            }
            cm.sendOk("獎勵發給您囉，請收好！");
            cm.dispose();
            return;
        default:
            cm.dispose();
            return;
    }
}

function log(level) {
    return "經典任務:" + quest[level][0][2];
}