// 隨機技能書x1

var status = -1;
var sel = -1;

var items = [
    2290000, 2290001, 2290002, 2290003, 2290004, 2290005, 2290006, 2290007, 2290008, 2290009,
    2290010, 2290011, 2290012, 2290013, 2290014, 2290015, 2290016, 2290017, 2290018, 2290019,
    2290020, 2290021, 2290022, 2290023, 2290024, 2290025, 2290026, 2290027, 2290028, 2290029,
    2290030, 2290031, 2290032, 2290033, 2290034, 2290035, 2290036, 2290037, 2290038, 2290039,
    2290040, 2290041, 2290042, 2290043, 2290044, 2290045, 2290046, 2290047, 2290048, 2290049,
    2290050, 2290051, 2290052, 2290053, 2290054, 2290055, 2290056, 2290057, 2290058, 2290059,
    2290060, 2290061, 2290062, 2290063, 2290064, 2290065, 2290066, 2290067, 2290068, 2290069,
    2290070, 2290071, 2290072, 2290073, 2290074, 2290075, 2290076, 2290077, 2290078, 2290079,
    2290080, 2290081, 2290082, 2290083, 2290084, 2290085, 2290086, 2290087, 2290088, 2290089,
    2290090, 2290091, 2290092, 2290093, 2290094, 2290095, 2290096, 2290097, 2290098, 2290099,
    2290100, 2290101, 2290102, 2290103, 2290104, 2290105, 2290106, 2290107, 2290108,
    2290110, 2290111, 2290112, 2290113, 2290114, 2290115, 2290116, 2290117, 2290118, 2290119,
    2290120, 2290121, 2290122, 2290123, 2290124, 2290125,
    2290140, 2290141, 2290142, 2290143, 2290144, 2290145, 2290146, 2290147, 2290148, 2290149,
    2290150, 2290151, 2290152, 2290153, 2290154, 2290155, 2290156, 2290157, 2290158, 2290159,
    2290160, 2290161, 2290162, 2290163,
];

var useItem = 4039532;
var quantity = 10;
var exchangeMessage = "隨機技能書";

function doAction() {
    var random = Math.floor(Math.random() * items.length);
    cm.gainItem(items[random], 1);
    cm.sendOk("恭喜您獲得#b#i" + items[random] + ":##k");
}

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }

    switch(status) {
        case 0:
            var msg = "交換" + exchangeMessage + "，\r\n需要材料#b#i" + useItem + ":##t" + useItem + "##k x" + quantity + "張";
            // msg += "\r\n#r#e※" + note + "#n#k";
            msg += "\r\n可兌換物品如下方：\r\n";
            for(var i = 0; i < items.length; i++) {
                msg += "#i" + items[i] + ":#  ";
            }
            msg += "\r\n#e您確定要交換嗎？";
            cm.sendYesNo(msg);
            break;
        case 1:
            if(!cm.canHold()) {
                cm.sendOk("使用命運卡系統請確認各欄位皆有至少一格空間！");
                cm.dispose();
                return;
            }
            if(!cm.haveItem(useItem, quantity)) {
                cm.sendOk("很抱歉，您沒有足夠的#b#i" + useItem + ":##t" + useItem + "##k");
                cm.dispose();
                return;
            }
            cm.gainItem(useItem, -quantity);
            doAction();
            cm.dispose();
            return;
        default:
            cm.dispose();
            return;
    }
}