function start(manager) {
    manager.addMessage("歡迎大家來到山羊谷，還沒進行帳號綁定的冒險者們可以進入 <#1301274501899751495> 綁定帳號，綁定後即可獲得2000楓葉點數");
    manager.addMessage("歡迎各位冒險者們在此文字頻道內聊天，每日0~6、6~12、12~18、18~24點區間，有任兩時段在此頻道留言，在午夜12點時皆可獲得額外活動獎勵");
    manager.addMessage("每日在語音頻道待滿超過2小時，會在午夜12點時結算，可以獲得額外活動獎勵");
    manager.addMessage("歡迎@小幫手 詢問我事情，可以問我 每日衝裝運勢、每日轉蛋運勢、每日打王運勢、每日命運卡運勢等等... 另外我也藏了一些彩蛋在對話內唷");
    manager.addMessage("目前有開創了官方交易群供大家使用，歡迎大家多加利用官方市集");
    manager.addMessage("歡迎大家在 <#1303923730644336714> 投稿心得分享文章，另外有建議的事項，歡迎大家在 <#1310171032946212865> 開立討論區討論");
}