var status = -1;
var selType = -1;
var selMob = -1;
var mobs = [
    [
        [100100, 2380000],    //嫩寶
        [100101, 2380001],    //藍寶
        [120100, 2380002],    //菇菇仔
        [130100, 2380003],    //木妖
        [130101, 2380004],    //紅寶
        [210100, 2380005],    //綠水靈
        [1210100, 2380006],   //肥肥
        [1210102, 2380007],   //菇菇寶貝
        [1110101, 2380008],   //黑木妖
        [1210101, 2380009],   //緞帶肥肥
        [1120100, 2380010],   //三眼章魚
        [1110100, 2380011],   //綠菇菇
        [1210103, 2380012],   //藍水靈
        [1130100, 2381000],   //斧木妖
        [1140100, 2381001],   //古木妖
        [2220100, 2381002],   //藍菇菇
        [2300100, 2381003],   //蝙蝠
        [2100100, 2381004],   //母砂兔
        [2100101, 2381005],   //公砂兔
        [2130103, 2381006],   //青蛇
        [2110200, 2381007],   //刺菇菇
        [2130100, 2381008],   //黑斧木妖
        [2230108, 2381009],   //海膽
        [2100102, 2381010],   //小仙人掌
        [2230103, 2381011],   //黃蜘蛛
        [5200000, 2381012],   //小石球
        [2230105, 2381013],   //綠海馬
        [2230110, 2381014],   //木面怪人
        [2100105, 2381015],   //沙漠蛇
        [2230101, 2381016],   //殭屍菇菇
        [2230107, 2381017],   //獨角尼莫
        [2230111, 2381018],   //石面怪人
        [2100106, 2381019],   //耳罩蜥蜴
        [2230106, 2381021],   //黃金海馬
        [2230102, 2381022],   //黑肥肥
        [2100103, 2381023],   //仙人掌
        [2230100, 2381024],   //火獨眼獸
        [2100107, 2381025],   //圍巾蜥蜴
        [2230109, 2381026],   //泡泡魚
        [2230104, 2381027],   //紅蜘蛛
        [2100104, 2381028],   //成年仙人掌
        [2230200, 2381029],   //花鯰魚
        [2100108, 2381030],   //狐蒙
        [3000000, 2381032],   //石球
        [3000001, 2381033],   //蝴蝶精
        [3000005, 2381034],   //褐色發條熊
        [3000006, 2381035],   //活跳蝦
        [3100102, 2381036],   //禿鷹
        [5200001, 2381037],   //冰石球
        [5200002, 2381038],   //火石球
        [3230307, 2382000],   //邱布
        [3230400, 2382001],   //兔子鼓手
        [3110100, 2382002],   //鱷魚
        [3210100, 2382003],   //火肥肥
        [3110101, 2382004],   //粉紅發條熊
        [3110102, 2382005],   //白色發條鼠
        [5300000, 2382006],   //利堤
        [3230104, 2382007],   //蒙面河豚
        [3100101, 2382008],   //沙漠矮人
        [3210200, 2382011],   //幼紅獨角獅
        [3210201, 2382012],   //幼黃獨角獅
        [3210202, 2382013],   //幼藍獨角獅
        [5300001, 2382014],   //黑利堤
        [3210204, 2382015],   //玩具鴨
        [3210205, 2382016],   //黑色發條鼠
        [3210207, 2382017],   //鼬鼠
        [3230100, 2382018],   //風獨眼獸
        [3230101, 2382019],   //小幽靈
        [3230200, 2382020],   //星光精靈
        [3230300, 2382021],   //幼魔精靈
        [3230302, 2382022],   //機器章魚
        [5400000, 2382023],   //小企鵝王
        [3210203, 2382025],   //發條貓熊
        [3210206, 2382026],   //黃色戰鬥機
        [3210450, 2382027],   //潛水企鵝王
        [3210208, 2382028],   //發條楓葉鼠
        [3210800, 2382029],   //猴子
        [3230102, 2382030],   //紅螃蟹
        [3230303, 2382031],   //粉紅色戰鬥機
        [3230306, 2382032],   //妖魔
        [3230103, 2382033],   //機器章魚王
        [3230304, 2382034],   //藍色戰鬥機
        [3230405, 2382035],   //粉紅小海豹
        [3230308, 2382037],   //特威德
        [3230305, 2382038],   //木馬士兵
        [4230100, 2382039],   //冰獨眼獸
        [4230101, 2382040],   //天使猴
        [4230113, 2382041],   //鼬鼠鬧鐘
        [4230116, 2382042],   //葛雷族人
        [4230200, 2382043],   //河豚
        [4230201, 2382044],   //毒河豚
        [4230500, 2382045],   //松鼠
        [4230600, 2382046],   //砂巨人
    ],[
        [4230107, 2382047],   //獨眼蝙蝠
        [4230111, 2382048],   //藍色機器人
        [4230114, 2382049],   //進化妖魔
        [4230119, 2382050],   //馬堤安
        [4230501, 2382051],   //豪豬
        [4230105, 2382052],   //食人花
        [4230103, 2382053],   //鋼之肥肥
        [4230109, 2382054],   //積木泥人
        [4230117, 2382055],   //葛雷士兵
        [4230124, 2382056],   //短牙海豹
        [4230108, 2382058],   //小獵犬
        [4230123, 2382059],   //長牙海豹
        [4230502, 2382060],   //黑豪豬
        [4230120, 2382061],   //培利堤安
        [4230112, 2382062],   //紅色機器人
        [4230125, 2382063],   //骷髏犬
        [4230106, 2382064],   //月光精靈
        [4130100, 2382065],   //土龍
        [4230110, 2382066],   //積木泥人王
        [4230118, 2382067],   //葛雷隊長
        [4230400, 2382069],   //鋼之黑肥肥
        [4230503, 2382070],   //青花蛇
        [4230504, 2382071],   //紅花蛇
        [4230121, 2383000],   //梅卡堤安
        [4130101, 2383001],   //烏龜
        [4230115, 2383002],   //妖魔隊長
        [4130102, 2383003],   //黑食人花
        [4230126, 2383005],   //木乃伊犬
        [4230505, 2383006],   //罈壺
        [4230102, 2383008],   //大幽靈
        [4230104, 2383009],   //青螃蟹
        [4230506, 2383010],   //蔘罈壺
        [5130100, 2383012],   //青龍
        [5100000, 2383013],   //小雪球
        [5100003, 2383014],   //小虎
        [5120503, 2383015],   //訓練用稻草人
        [5100002, 2383017],   //火精靈
        [5120504, 2383018],   //訓練用木頭人
        [5130103, 2383019],   //黑鱷魚
        [5120000, 2383020],   //日光精靈
        [5120001, 2383021],   //紅獨角獅
        [5120002, 2383022],   //黃獨角獅
        [5120003, 2383023],   //藍獨角獅
        [5100005, 2383024],   //虎傑
        [5120501, 2383025],   //深山人蔘
        [5120502, 2383027],   //千年人蔘
        [5300100, 2383029],   //巫婆
        [5130101, 2383030],   //石巨人
        [5130104, 2383031],   //野狼
        [5120506, 2383032],   //書靈
        [5130105, 2383033],   //黑色小雪球
        [5100004, 2383034],   //三尾狐
        [5120500, 2383035],   //功夫熊
        [5150001, 2383036],   //骷髏士兵
        [5130107, 2383037],   //殭屍
        [5130108, 2383038],   //礦山殭屍
        [5130102, 2383039],   //黑曜石巨人
        [5140000, 2383040],   //白狼
        [5120505, 2383041],   //梅花鹿
        [5150000, 2383043],   //混種石巨人
        [6130100, 2383044],   //赤龍
        [6130103, 2383045],   //企鵝王
        [6130201, 2383046],   //小鬼怪
        [6130203, 2383047],   //柔道貓熊
        [6130200, 2384000],   //小丑柏非
        [6230100, 2384001],   //魔龍
        [6130207, 2384002],   //蟠猴
        [6230602, 2384003],   //骷髏士官
        [6230400, 2384004],   //幽魂發條熊
        [6230401, 2384005],   //幼黑格里芬
        [6230600, 2384006],   //冰龍
        [6230200, 2384007],   //黑企鵝王
        [6130204, 2384008],   //鱷魚克洛克
        [6300000, 2384009],   //雪吉拉
        [6230300, 2384012],   //小丑瑞奇
        [6130209, 2384013],   //喵仙
        [6230500, 2384014],   //幽魂發條熊隊長
        [6230601, 2384015],   //黑龍
        [6400000, 2384016],   //黑吉拉
        [6130208, 2384017],   //船員克魯
        [8140200, 2384019],   //冥鐘
        [7130100, 2384020],   //月牙牛魔王
        [7130500, 2384024],   //萊西
        [7130104, 2384025],   //大副凱丁
        [7130001, 2384026],   //地獄獵犬
        [7130002, 2384027],   //橡木甲蟲
        [7130600, 2384028],   //侏儒怪
        [7130103, 2384029],   //骷髏指揮官
        [7130000, 2384030],   //黑格里芬
        [6300100, 2384032],   //貝爾芬
        [7130501, 2384033],   //黑暗萊西
        [7130200, 2384035],   //狼人
        [7130101, 2384036],   //長槍牛魔王
        [8140300, 2385000],   //黑暗冥鐘
        [7130003, 2385001],   //金屬甲蟲
        [7130601, 2385002],   //邪惡侏儒怪
        [6400100, 2385003],   //特貝爾芬
        [7130004, 2385005],   //變種侏儒怪
        [9400545, 2450000],   //機械蜘蛛
        [8140000, 2385006],   //白狼人
        [8140001, 2385007],   //哈維
    ],[
        [7140000, 2385010],   //百烈
        [8140002, 2385011],   //血腥哈維
        [7130010, 2385012],   //怨靈發條熊
        [8140110, 2385014],   //邪惡綿羊
        [7160000, 2385015],   //多立百烈
        [8140101, 2385016],   //暗黑半人馬
        [8140102, 2385017],   //火焰半人馬
        [8140103, 2385018],   //寒冰半人馬
        [8140111, 2385019],   //惡魔綿羊
        [7130300, 2385020],   //怨靈發條熊隊長
        [8140500, 2385021],   //煉獄獵犬
        [8140700, 2385022],   //藍色雙角龍
        [8200001, 2386021],   //回憶祭司
        [8140600, 2386000],   //骨骸魚
        [8140701, 2386001],   //暗黑三角龍
        [8141000, 2386002],   //維京
        [8141300, 2386003],   //烏賊怪
        [8200002, 2386022],   //回憶神官
        [8142000, 2386004],   //幽魂女巫
        [8140702, 2386005],   //獨角迅猛龍
        [8140703, 2386006],   //進化迅猛龍
        [8142100, 2386007],   //致命烏賊怪
        [8150300, 2386008],   //赤翼龍
        [8141100, 2386009],   //巨人維京
        [8200003, 2386023],   //回憶守護兵
        [8143000, 2386010],   //怨靈女巫
        [8150200, 2386011],   //短刃龍戰士
        [9400013, 2386018],   //雪女
        [8190000, 2386017],   //幼年龍
        [8150100, 2386012],   //鯊魚
        [8150301, 2386013],   //藍翼龍
        [8200004, 2386024],   //回憶守護隊長
        [8150101, 2386014],   //尖鼻鯊魚
        [8150302, 2386015],   //黑翼龍
        [8150201, 2386016],   //雙刀龍戰士
        [8190005, 2387004],   //幼龍保護者
        [8200005, 2387006],   //悔恨祭司
        [8200006, 2387007],   //悔恨神官
        [8190003, 2387002],   //化石龍
        [8190004, 2387003],   //化石龍長老
        [8200007, 2387008],   //悔恨守護兵
        [8200008, 2387009],   //悔恨守護隊長
        [8200009, 2387010],   //忘卻祭司
        [8200010, 2387011],   //忘卻神官
        [8200011, 2387012],   //忘卻守護兵
        [8200012, 2387013],   //忘卻守護隊長
    ]
    ];  

var items = [
	5800000,5800001,5800002,5800006, 5800007
];

var umap = 270090002;
var exit = false;
var returnMap = 910000000;


function start() {
    action(1,0,0);
}
  
function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        status--;
    } else {
        cm.dispose();
        return;
    }
    

    switch(status) {
        case 0:
            if(cm.getPlayer().getMapId() == umap) {
                cm.sendYesNo("請問您要退出高級修練場嗎？");
                exit = true;
                break;
            }

            if(cm.getPlayer().getParty() == null) {
                cm.sendOk("請先組隊再來找我唷！");
                cm.dispose();
                return;
            }

            if(!cm.isLeader()) {
                cm.sendOk("進入訓練場必須由隊長申請！");
                cm.dispose();
                return;
            }
            var msg = "這是山羊谷高級修練場，請問您想做什麼？\r\n#b#L0#我想選取40等以下怪物\r\n#L1#我想選取41~80等的怪物\r\n#L2#我想選取81等以上怪物";
            cm.sendNext(msg);
            break;
        case 1:
            if(exit) {
                if(cm.isLeader()) {
                    cm.getPlayer().warpPartyInSameMap(returnMap);
                } else {
                    cm.warp(returnMap);
                }
                cm.dispose();
                return;
            }

            selType = selection;
            var msg = "請問您想選擇哪個怪物修練呢？\r\n#r※請注意：訓練場VIP券購買後即開始倒數計時，請謹慎購買。#k";
            for (var i = 0; i < mobs[selType].length; i++) {
				msg += "\r\n#L" + i + "# #b"  + cm.getIcon(mobs[selType][i][1]) + " " + cm.getMobName(mobs[selType][i][0]) + "的房間";
			}
			cm.sendOk(msg); 
            break;
        case 2:
            selMob = selection;
            var msg = "您選擇的怪物是:#b" + cm.getIcon(mobs[selType][selMob][1]) + " " + cm.getMobName(mobs[selType][selMob][0]);
            msg += "\r\n請選擇入場卷：\r\n#r※多人組隊時，怪物的等級只能比隊伍中等級最低的成員高出不超過5級。#k\r\n#b";
            for (var i = 0; i < items.length; i++) {
                msg += "\r\n#L" + i + "#使用 #i" + items[i] + ":##t" + items[i] + "#";
            }
            msg += "\r\n#L99#使用 怪物卡 進行單人進入(需消耗一張對應怪物卡)";
            cm.sendOk(msg);
            break;
        case 3:
            var selItem = selection;
            var mobid = mobs[selType][selMob][0];
            if(selItem == 99) {
                if(cm.getPlayer().getMonsterBook().getLevelByCard(mobs[selType][selMob][1]) < 1) {
                    cm.sendOk("很抱歉，您的卡片數不足，無法進入。");
                    cm.dispose();
                    return;
                }
                var msg = "您擁有" + cm.getIcon(mobs[selType][selMob][1]) + "卡片，目前有 " + cm.getPlayer().getMonsterBook().getLevelByCard(mobs[selType][selMob][1]) +" 張，請問您確定要進入嗎？";
                cm.sendYesNo(msg);
                break;
            }

            var itemid = items[selItem];
            if(!cm.haveItem(itemid)) {
                cm.sendSimple("你沒有購買票券");
                cm.dispose();
                return;
            }
            if((cm.getPlayer().getParty().getMembers().size() > 1) && cm.getMobLevel(mobid) > cm.findPartyMinLevel() + 5) {
                cm.sendSimple("選取怪物等級不能高於全隊伍最低等中角色5等以上！");
                cm.dispose();
                return;
            }
            if(!cm.allMembersHere()) {
                cm.sendSimple("請確認隊員是否到齊！")
                cm.dispose();
                return;
            }
            cm.sendOk(cm.進入訓練場(itemid,mobid,umap));
            cm.dispose();
            return;
        case 4:
            var mobid = mobs[selType][selMob][0];
            cm.sendOk(cm.進入訓練場(-1,mobid,umap));
            cm.removeMonsterCard(mobs[selType][selMob][1]);
            cm.dispose();
            return;
        default:
            cm.dispose();
            break;
    }
}